#Необхідно створити скріпт, який буде загорнутий у функцію з аргументами А, В та С.
#Робити він має наступне:
#1. Порівнювати аргументи А та В
#2. Якщо аргумент А, менший за В, то збільшувати А на інкремент С
#3. Порівнювати збільшений А з В
#4. Якщо А досі менший - крок 2 повторюється
#5. Якщо А дорівнює, або більший за В - вивести щось радісне до консолі
num_a = input("Введіть аргумент А:")
num_b = input("Введіть аргумент B:")
num_c = input("Введіть аргумент С:")
a = int(num_a)
b = int(num_b)
c = int(num_c)
i=1
while i < b:
    if a < b:
        a += c
        print("a" + str(i) + "=" + str(a))
    elif a >= b:
        print("Today is a wonderful day")
        break
    i += 1
